function check(q){
  let answer = prompt(q, "");
  return answer;
}

let name = prompt("Введіть ваше ПІБ.", "");
alert("Відповідайте на всі питання цифрами 1 або 0, де 1 - так, 0 - ні.");

let arr = new Array();
arr[0] = "Питання 1. Функція є процедурою JavaScript, це набір команд, які виконують ту чи іншу задачу, або розраховують значення. Щоб використати функцію, ви маєте десь її визначити у тій області видимості, звідки ви бажаєте її викликати.";
arr[1] = "Питання 2. Визначення функції складається з ключового слова function.";
arr[2] = "Питання 3. Після function слідує: ім'я функції, список параметрів, команди, які визначають фунцію";
arr[3] = "Питання 4. Примітивні параметри (такі, як число) передаються функціям за значенням; значення передається до функції, але якщо функція змінює значення параметра, ця зміна не відображається глобально або у функції виклику.";
arr[4] = "Питання 5. Якщо ви передаєте об'єкт (тобто, непримітивне значення, наприклад, Array або визначений користувачем об'єкт) у якості параметра, і функція змінює властивості об'єкта, ця зміна видима за межами функції.";
arr[5] = "Питання 6. Функції також можуть бути створені за допомогою функціональних виразів. Така функція може бути анонімною; їй не обов'язково мати ім'я.";
arr[6] = "Питання 7. Визначення функції не виконує її. Визначення функції просто називає функцію і вказує, що робити, коли викликається функція. Виклик функції, власне, виконує вказані дії з вказаними параметрами.";
let res = [1,1,1,1,1,1,1];
let result = 0;

for(var i = 0; i < arr.length; i++){
  var a = check(arr[i]);
  if(a == res[i]){
    result++;
  }
}

alert(name + ", ви здали тест на " + result);
