function check(q){
  let answer = prompt(q, "");
  return answer;
}

let name = prompt("Введіть ваше ПІБ.", "");
alert("Відповідайте на всі питання цифрами 1 або 0, де 1 - так, 0 - ні.");

let q1 = "Питання 1. Функція є процедурою JavaScript, це набір команд, які виконують ту чи іншу задачу, або розраховують значення. Щоб використати функцію, ви маєте десь її визначити у тій області видимості, звідки ви бажаєте її викликати.";
let q2 = "Питання 2. Визначення функції складається з ключового слова function.";
let q3 = "Питання 3. Після function слідує: ім'я функції, список параметрів, команди, які визначають фунцію";
let q4 = "Питання 4. Примітивні параметри (такі, як число) передаються функціям за значенням; значення передається до функції, але якщо функція змінює значення параметра, ця зміна не відображається глобально або у функції виклику.";
let q5 = "Питання 5. Якщо ви передаєте об'єкт (тобто, непримітивне значення, наприклад, Array або визначений користувачем об'єкт) у якості параметра, і функція змінює властивості об'єкта, ця зміна видима за межами функції.";
let q6 = "Питання 6. Функції також можуть бути створені за допомогою функціональних виразів. Така функція може бути анонімною; їй не обов'язково мати ім'я.";
let q7 = "Питання 7. Визначення функції не виконує її. Визначення функції просто називає функцію і вказує, що робити, коли викликається функція. Виклик функції, власне, виконує вказані дії з вказаними параметрами.";
let res = 0;

for(var i=0; i<7; i++){
  switch (i) {
    case 0:
      var a = check(q1);
      if(a == 1){
        res++;
      }
      break;
    case 1:
      a = check(q2);
      if(a == 1){
        res++;
      }
      break;
    case 2:
      a = check(q3);
      if(a == 1){
        res++;
      }
      break;
    case 3:
      var a = check(q4);
      if(a == 1){
        res++;
      }
      break;
    case 4:
      a = check(q5);
      if(a == 1){
        res++;
      }
      break;
    case 5:
      a = check(q6);
      if(a == 1){
        res++;
      }
      break;
    case 6:
      a = check(q7);
      if(a == 1){
        res++;
      }
      break;
    default:
  }
}

alert(name + ", ви здали тест на " + res);
