var i=0;

var Name ="";
Name = prompt("Your name: ");

if(!confirm("В дужках оисанийобітовий здвиг вправо\n(<<)"))
    i++;
if(confirm("Побітне НЕ повертає число, з бітами, розташованиими в зворотньому порядку"))
    i++;
if(!confirm("Знак '~' це знак побітового виключаючого АБО"))
    i++;
if(confirm("& це знак побітового І"))
    i++;
if(confirm("Побітове І Повертає число, результат побітового порівняння 'I'"))
    i++;
if(!confirm("Чи існує оерація повного зсуву вліво"))
    i++;
alert("Студент " + Name + " набрав " + i + " з 6 балів.")