function check(q){
  let answer = prompt(q, "");
  return answer;
}

let name = prompt("Введіть ваше ПІБ.", "");
alert("Відповідайте на всі питання цифрами 1 або 0, де 1 - так, 0 - ні.");

let arr = new Array();
arr[0] = "Питання 1. В дужках оисанийобітовий здвиг вправо\n(<<).";
arr[1] = "Питання 2. Побітне НЕ повертає число, з бітами, розташованиими в зворотньому порядку.";
arr[2] = "Питання 3. Знак '~' це знак побітового виключаючого АБО";
arr[3] = "Питання 4. & це знак побітового І.";
arr[4] = "Питання 5. Побітове І Повертає число, результат побітового порівняння 'I'.";
arr[5] = "Питання 6. Чи існує оерація повного зсуву вліво.";
let res = [0,1,0,1,1,0];
let result = 0;

for(var i = 0; i < arr.length; i++){
  var a = check(arr[i]);
  if(a == res[i]){
    result++;
  }
}

alert("Студент " + name + " набрав " + result + " з 6 балів.")
